Mikhail-Za/trail-mate-T-display-p4-/builds/esp_idf/targets/tdisplayp4_tft/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_PANEL_HI8561=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_PIXEL_FORMAT_RGB565=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_LVGL_BUFFER_LINES=80
# LVGL heap: the default 64KB builtin pool is exhausted by the 34-row Chat settings
# page (8 channel slots x enable/name/key). When full, lv_malloc_zeroed() for the
# focus style-transition returns NULL and LVGL writes through it unchecked -> store
# fault at 0x0 on Settings->Chat. Triple the pool; it lives in internal RAM and there
# is ~440KB of free internal heap, so this leaves ample headroom.
CONFIG_LV_MEM_SIZE_KILOBYTES=192
